# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+startup: overview indent auto-fill
#+export_file_name: ./html/ClassicalInfoQuantumInfo.html
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
#+PROPERTY: header-args :eval never-export

#+title: Classical and Quantum Information
#+author: Dr. E.P. Blair


* Notebook Setup                                                   :noexport:

The following is helpful if we want to have =org-mode= sessions linking
multiple code blocks /and/ we are using =direnv=.

#+begin_src emacs-lisp :eval never-export
(setq-local org-babel-python-command (expand-file-name "../.direnv/python-3.11/bin/python3"))
#+end_src

#+RESULTS:
: /Users/enrique_blair/Library/CloudStorage/Box-Box/Teaching/GitHub/BU-ECE-IntroQuantumComputing/.direnv/python-3.11/bin/python3


#+begin_src python :results output :eval never-export
import sys

print(sys.executable)
#+end_src

#+RESULTS:
: /Users/enrique_blair/Library/CloudStorage/Box-Box/Teaching/GitHub/BU-ECE-IntroQuantumComputing/.direnv/python-3.11/bin/python3




**** Example: Find \(\braket{0|0}\) and \(\braket{1|1}\).

\begin{equation}
\braket{0|0}=\left[\begin{array}{cc}
1 & 0\end{array}\right]\left[\begin{array}{c}
1\\
0
\end{array}\right]=1\cdot1+0\cdot0=1
\end{equation}
\begin{equation}
\braket{1|1}=\left[\begin{array}{cc}
0 & 1\end{array}\right]\left[\begin{array}{c}
0\\
1
\end{array}\right]=0\cdot0+1\cdot1=1
\end{equation}

Thus, the computational basis
states are normalized.\\


We also can do this numerically in Python:
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
  # Enable the use of the numpy package
  import numpy as np

  '''
       In Python:
       np.array([[a, b, c], [d, e, f]]) makes
       a 2x3 matrix. It's better to use array instead of matrix
       as the support for the matrix function is being removed in the future.
  '''
  ket0 = np.array([[1], [0]])
  ket1 = np.array([[0], [1]])

  # To get the Hermitian conjugate, use .conj().T
  # use @ for matrix multiplication of the arrays
  braket0_0 = ket0.conj().T @ ket0
  braket1_1 = ket1.conj().T @ ket1

  #in python we need to use print to see the results

  print(f'braket0_0 = {braket0_0}')
  print(f'braket1_1 = {braket1_1}')

  print(braket0_0[0, 0])
#+end_src

#+RESULTS:
: braket0_0 = [[1]]
: braket1_1 = [[1]]
: 1

We used the [[https://numpy.org][numpy]] package because it gives us
access to numerical linear algebra functionality in Python. In Python,
the result of this calculation is a \(1\times1\) matrix (a scalar)
(i.e., =[[1]]=. If we wanted to treat it as a scalar, we would need to
extract the scalar value: =braket0_0[0,0]=. Python is zero-indexed, so
=braket0_0[0,0]= returns the element in the first column of the first
row of =braket0_0=. MATLAB, on the other hand, is one-indexed, so that
=M(1,1)= refers to the element in the first column of the first row of
matrix =M=.

- When a state has unit length (norm), it is said to be *normalized*.,
  and it satisfies the following:
  \begin{equation}
  \braket{\psi|\psi}=\sqrt{\braket{\psi|\psi}}=1\qquad(\text{normalization})\label{eq:DefineNormalization}
  \end{equation}
  Thus, we have seen above that the computational basis states
  \(\left\{ \ket{0},\ket{1}\right\}\) are normalized

- *We need quantum states to be normalized in order to have a
  probabilistic interpretation of their amplitudes*

- Any wave function \(\ket{\psi}\) with \(0<\braket{\psi|\psi}<\infty\)
  may be normalized to \(\braket{\psi^{\prime}|\psi^{\prime}}\) such
  that \(\braket{\psi^{\prime}|\psi^{\prime}}=1\)

  - To do this, simply divide \(\ket{\psi}\) by its length,
    \(\sqrt{\braket{\psi^{\prime}|\psi^{\prime}}}\):
    \begin{equation}
    \ket{\psi^{\prime}}=\frac{\ket{\psi}}{\sqrt{\braket{\psi^{\prime}|\psi^{\prime}}}}\label{eq:NormalizePsi}
    \end{equation}

**** Example: Find \(\braket{0|1}\) and \(\braket{1|0}\).


\begin{equation}
\braket{0|1}=\left[\begin{array}{cc}
1 & 0\end{array}\right]\left[\begin{array}{c}
0\\
1
\end{array}\right]=1\cdot0+0\cdot1=0
\end{equation}
\begin{equation}
\braket{1|0}=\left[\begin{array}{cc}
0 & 1\end{array}\right]\left[\begin{array}{c}
1\\
0
\end{array}\right]=0\cdot1+1\cdot0=0
\end{equation}
In this case,
\(\braket{0|1}=\braket{1|0}\).\\

In Python, this becomes:

#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
  # Enable the use of the numpy package
  import numpy as np

  ket0 = np.array([[1], [0]])
  ket1 = np.array([[0], [1]])

  # In Python:
  # (1) To get the Hermitian conjugate, use .conj().T
  # (2) use @ for matrix mulitply
  braket0_1 = ket0.conj().T @ ket1
  braket1_0 = ket1.conj().T @ ket0

  # In Python, we must use print() to see results
  print(f'braket0_1 = {braket0_1}')
  print(f'braket1_0 = {braket1_0}')

#+end_src

#+RESULTS:
: braket0_1 = [[0]]
: braket1_0 = [[0]]


- When a pair of states \(\ket{\chi}\) and \(\ket{\psi}\) have zero
  inner product, they are said to be orthogonal, and they satisfy
  \begin{equation}
  \braket{\psi|\chi}=\braket{\chi|\psi}=0\qquad(\text{orthogonality})\label{eq:Orthogonal}
  \end{equation}

  - This is just like perpendicular (orthogonal) vectors in 2D or 3D
    when they have zero inner (dot) product

